# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 32  # number of classes
depth_multiple: 1  # scales module repeats
width_multiple: 1  # scales convolution channels


config:
  detect:
    bbox:
      nc:  32   # Number of FDIs Classes
  attribute:
    is_impacted:
      nc:  1    # Binary Classification
    is_caries:
      nc:  1    
    is_lesion:
      nc:  1
    is_deepcaries:
      nc:  1

# YOLOv8.0m backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, CoordConv, [64, 3, 2]]  # 0-P1/2 320
  - [-1, 1, CoordConv, [128, 3, 2]]  # 1-P2/4 160
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 80
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 40
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [768, 3, 2]]  # 7-P5/32 20
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, SPPF, [768, 5]]  # 9

# YOLOv8.0m head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f, [128]]  # 18 (P2/4-tiny)

  - [-1, 1, CoordConv, [ 128, 3, 2 ] ]
  - [[-1, 15], 1, Concat, [ 1 ] ]  # cat head P3
  - [-1, 3, C2f, [ 256 ]]  # 21 (P3/8-small)

  - [-1, 1, CoordConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 24 (P4/16-medium)

  - [[18, 21, 24], 1, IDetect, [config]] 
